Revit 2026 API

# PathOfTravelFindStartsOfLongestPathsFromRooms Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<XYZ> FindStartsOfLongestPathsFromRooms(
	View DBView,
	IList<XYZ> destinationPoints
)
```
```vb
Public Shared Function FindStartsOfLongestPathsFromRooms (
	DBView As View,
	destinationPoints As IList(Of XYZ)
) As IList(Of XYZ)
```
```cpp
public:
static IList<XYZ^>^ FindStartsOfLongestPathsFromRooms(
	View^ DBView,
	IList<XYZ^>^ destinationPoints
)
```
```fsharp
static member FindStartsOfLongestPathsFromRooms :
        DBView : View *
        destinationPoints : IList<XYZ> -> IList<XYZ>
```

#### Parameters

DBView View

destinationPoints IListXYZ

#### Return Value

IListXYZ

#### Reference

PathOfTravel Class

Autodesk.Revit.DB.Analysis Namespace